HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCpu_reg.h
/** Alias (User Manual Name) for CPU1_SPROT_RGN1_LA.
* To use register names with standard convension, please use CPU1_SPROT_RGN1_LA.
*/
#define	CPU1_SPROT_RGNLA1	(CPU1_SPROT_RGN1_LA)

/** \\brief  E014, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E014u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN1_UA.
* To use register names with standard convension, please use CPU1_SPROT_RGN1_UA.
*/
#define	CPU1_SPROT_RGNUA1	(CPU1_SPROT_RGN1_UA)

/** \\brief  E028, CPU Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGN2_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF882E028u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN2_ACCENA.
* To use register names with standard convension, please use CPU1_SPROT_RGN2_ACCENA.
*/
#define	CPU1_SPROT_RGNACCENA2	(CPU1_SPROT_RGN2_ACCENA)

/** \\brief  E02C, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGN2_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF882E02Cu)

/** Alias (User Manual Name) for CPU1_SPROT_RGN2_ACCENB.
* To use register names with standard convension, please use CPU1_SPROT_RGN2_ACCENB.
*/
#define	CPU1_SPROT_RGNACCENB2	(CPU1_SPROT_RGN2_ACCENB)

/** \\brief  E020, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E020u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN2_LA.
* To use register names with standard convension, please use CPU1_SPROT_RGN2_LA.
*/
#define	CPU1_SPROT_RGNLA2	(CPU1_SPROT_RGN2_LA)

/** \\brief  E024, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E024u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN2_UA.
* To use register names with standard convension, please use CPU1_SPROT_RGN2_UA.
*/
#define	CPU1_SPROT_RGNUA2	(CPU1_SPROT_RGN2_UA)

/** \\brief  E038, CPU Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGN3_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF882E038u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN3_ACCENA.
* To use register names with standard convension, please use CPU1_SPROT_RGN3_ACCENA.
*/
#define	CPU1_SPROT_RGNACCENA3	(CPU1_SPROT_RGN3_ACCENA)

/** \\brief  E03C, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGN3_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF882E03Cu)

/** Alias (User Manual Name) for CPU1_SPROT_RGN3_ACCENB.
* To use register names with standard convension, please use CPU1_SPROT_RGN3_ACCENB.
*/
#define	CPU1_SPROT_RGNACCENB3	(CPU1_SPROT_RGN3_ACCENB)

/** \\brief  E030, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E030u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN3_LA.
* To use register names with standard convension, please use CPU1_SPROT_RGN3_LA.
*/
#define	CPU1_SPROT_RGNLA3	(CPU1_SPROT_RGN3_LA)

/** \\brief  E034, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E034u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN3_UA.
* To use register names with standard convension, please use CPU1_SPROT_RGN3_UA.
*/
#define	CPU1_SPROT_RGNUA3	(CPU1_SPROT_RGN3_UA)

/** \\brief  E048, CPU Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGN4_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF882E048u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN4_ACCENA.
* To use register names with standard convension, please use CPU1_SPROT_RGN4_ACCENA.
*/
#define	CPU1_SPROT_RGNACCENA4	(CPU1_SPROT_RGN4_ACCENA)

/** \\brief  E04C, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGN4_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF882E04Cu)

/** Alias (User Manual Name) for CPU1_SPROT_RGN4_ACCENB.
* To use register names with standard convension, please use CPU1_SPROT_RGN4_ACCENB.
*/
#define	CPU1_SPROT_RGNACCENB4	(CPU1_SPROT_RGN4_ACCENB)

/** \\brief  E040, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E040u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN4_LA.
* To use register names with standard convension, please use CPU1_SPROT_RGN4_LA.
*/
#define	CPU1_SPROT_RGNLA4	(CPU1_SPROT_RGN4_LA)

/** \\brief  E044, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E044u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN4_UA.
* To use register names with standard convension, please use CPU1_SPROT_RGN4_UA.
*/
#define	CPU1_SPROT_RGNUA4	(CPU1_SPROT_RGN4_UA)

/** \\brief  E058, CPU Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGN5_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF882E058u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN5_ACCENA.
* To use register names with standard convension, please use CPU1_SPROT_RGN5_ACCENA.
*/
#define	CPU1_SPROT_RGNACCENA5	(CPU1_SPROT_RGN5_ACCENA)

/** \\brief  E05C, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGN5_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF882E05Cu)

/** Alias (User Manual Name) for CPU1_SPROT_RGN5_ACCENB.
* To use register names with standard convension, please use CPU1_SPROT_RGN5_ACCENB.
*/
#define	CPU1_SPROT_RGNACCENB5	(CPU1_SPROT_RGN5_ACCENB)

/** \\brief  E050, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E050u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN5_LA.
* To use register names with standard convension, please use CPU1_SPROT_RGN5_LA.
*/
#define	CPU1_SPROT_RGNLA5	(CPU1_SPROT_RGN5_LA)

