HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCpu_reg.h
/** \\brief  E054, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E054u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN5_UA.
* To use register names with standard convension, please use CPU1_SPROT_RGN5_UA.
*/
#define	CPU1_SPROT_RGNUA5	(CPU1_SPROT_RGN5_UA)

/** \\brief  E068, CPU Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGN6_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF882E068u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN6_ACCENA.
* To use register names with standard convension, please use CPU1_SPROT_RGN6_ACCENA.
*/
#define	CPU1_SPROT_RGNACCENA6	(CPU1_SPROT_RGN6_ACCENA)

/** \\brief  E06C, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGN6_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF882E06Cu)

/** Alias (User Manual Name) for CPU1_SPROT_RGN6_ACCENB.
* To use register names with standard convension, please use CPU1_SPROT_RGN6_ACCENB.
*/
#define	CPU1_SPROT_RGNACCENB6	(CPU1_SPROT_RGN6_ACCENB)

/** \\brief  E060, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E060u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN6_LA.
* To use register names with standard convension, please use CPU1_SPROT_RGN6_LA.
*/
#define	CPU1_SPROT_RGNLA6	(CPU1_SPROT_RGN6_LA)

/** \\brief  E064, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E064u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN6_UA.
* To use register names with standard convension, please use CPU1_SPROT_RGN6_UA.
*/
#define	CPU1_SPROT_RGNUA6	(CPU1_SPROT_RGN6_UA)

/** \\brief  E078, CPU Safety Protection Region Access Enable Register A */
#define CPU1_SPROT_RGN7_ACCENA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENA*)0xF882E078u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN7_ACCENA.
* To use register names with standard convension, please use CPU1_SPROT_RGN7_ACCENA.
*/
#define	CPU1_SPROT_RGNACCENA7	(CPU1_SPROT_RGN7_ACCENA)

/** \\brief  E07C, CPU Safety Protection Region Access Enable Register B */
#define CPU1_SPROT_RGN7_ACCENB /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_ACCENB*)0xF882E07Cu)

/** Alias (User Manual Name) for CPU1_SPROT_RGN7_ACCENB.
* To use register names with standard convension, please use CPU1_SPROT_RGN7_ACCENB.
*/
#define	CPU1_SPROT_RGNACCENB7	(CPU1_SPROT_RGN7_ACCENB)

/** \\brief  E070, CPU Safety Protection Region Lower Address Register */
#define CPU1_SPROT_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_LA*)0xF882E070u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN7_LA.
* To use register names with standard convension, please use CPU1_SPROT_RGN7_LA.
*/
#define	CPU1_SPROT_RGNLA7	(CPU1_SPROT_RGN7_LA)

/** \\brief  E074, CPU Safety protection Region Upper Address Register */
#define CPU1_SPROT_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_CPU_SPROT_RGN_UA*)0xF882E074u)

/** Alias (User Manual Name) for CPU1_SPROT_RGN7_UA.
* To use register names with standard convension, please use CPU1_SPROT_RGN7_UA.
*/
#define	CPU1_SPROT_RGNUA7	(CPU1_SPROT_RGN7_UA)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCPU_REG_H */
